; domain
(define (domain PROPER_navigation_domain)

(:requirements :adl :derived-predicates :strips :typing :conditional-effects :negative-preconditions :equality :fluents)

(:types
	room
)

(:functions
	(max_no_blocks)
	(no_blocks)
)

(:predicates 

        (production_room ?r - room)
        (assembly_room ?r - room)
        (presented_task ?r - room)
        (at ?r - room)
        (human_present) 
        (block_to_deliver)
        (empty_robot)
        (finished)
)



(:action reaching_production_room
    :parameters (?l1 ?l2 - room)
    :precondition (and 
            (at ?l1)
            (production_room ?l2)
    )
    :effect (and 
            (not (at ?l1))
            (at ?l2)
    )
)


(:action reaching_assembly_room
    :parameters (?l1 ?l2 - room)
    :precondition (and 
            (at ?l1)
            (assembly_room ?l2)
    )
    :effect (and 
            (not (at ?l1))
            (at ?l2)
    )
)


(:action present_assembly_room
    :parameters (?l1 - room)
    :precondition (and 
            (at ?l1)
            (assembly_room ?l1)
    )
    :effect (and 
            (presented_task ?l1)
    )
)


(:action present_production_room
    :parameters (?l1 - room)
    :precondition (and 
            (at ?l1)
            (production_room ?l1)
    )
    :effect (and 
            (presented_task ?l1)
    )
)



(:action ask_pick_the_block
    :parameters (?l1 - room)
    :precondition (and 
            (at ?l1)
            (production_room ?l1)
            (presented_task ?l1)
            (human_present) 
            (empty_robot) 
    )
    :effect (and
    	    (not(empty_robot)) 
            (block_to_deliver) 
    )
)


(:action ask_assembly_block
    :parameters (?l1 - room)
    :precondition (and 
            (at ?l1)
            (assembly_room ?l1)
            (presented_task ?l1)
            (human_present) 
            (block_to_deliver) 
             
    )
    :effect (and
    	    (not(block_to_deliver)) 
            (empty_robot)
            (increase (no_blocks) 1)
    )
)



(:action check_finished
    :parameters (?l1 - room)
    :precondition (and 
            (at ?l1)
            (assembly_room ?l1)
            (>(no_blocks)(max_no_blocks))
    )
    :effect (and
    	    (finished)
    )
)

)

; problem
(define (problem p) (:domain PROPER_navigation_domain)
(:objects
	r1 - room
	r2 - room
)

(:init
        (assembly_room r1)
        (production_room r2)
        (at r1)
        (=(max_no_blocks)3)
        (=(no_blocks)0)
        (human_present) 
        (empty_robot)
        
)


(:goal  
    (and 
         (finished)
    )
)

;un-comment the following line if metric is needed
;(:metric minimize (???))
)

; plan
1. (reaching_production_room r1 r2)
   deleted: (at r1)
   added: (at r2)
   goals met: 0 of 1
2. (present_production_room r2)
   added: (presented_task r2)
   goals met: 0 of 1
3. (ask_pick_the_block r2)
   deleted: (empty_robot)
   added: (block_to_deliver)
   goals met: 0 of 1
4. (reaching_assembly_room r2 r1)
   deleted: (at r2)
   added: (at r1)
   goals met: 0 of 1
5. (present_assembly_room r1)
   added: (presented_task r1)
   goals met: 0 of 1
6. (ask_assembly_block r1)
   deleted: (block_to_deliver)
   added: (empty_robot)
   changed: (no_blocks) from 0 to 1
   goals met: 0 of 1
7. (reaching_production_room r1 r2)
   deleted: (at r1)
   added: (at r2)
   goals met: 0 of 1
8. (ask_pick_the_block r2)
   deleted: (empty_robot)
   added: (block_to_deliver)
   goals met: 0 of 1
9. (reaching_assembly_room r2 r1)
   deleted: (at r2)
   added: (at r1)
   goals met: 0 of 1
10. (ask_assembly_block r1)
   deleted: (block_to_deliver)
   added: (empty_robot)
   changed: (no_blocks) from 1 to 2
   goals met: 0 of 1
11. (reaching_production_room r1 r2)
   deleted: (at r1)
   added: (at r2)
   goals met: 0 of 1
12. (ask_pick_the_block r2)
   deleted: (empty_robot)
   added: (block_to_deliver)
   goals met: 0 of 1
13. (reaching_assembly_room r2 r1)
   deleted: (at r2)
   added: (at r1)
   goals met: 0 of 1
14. (ask_assembly_block r1)
   deleted: (block_to_deliver)
   added: (empty_robot)
   changed: (no_blocks) from 2 to 3
   goals met: 0 of 1
15. (reaching_production_room r1 r2)
   deleted: (at r1)
   added: (at r2)
   goals met: 0 of 1
16. (ask_pick_the_block r2)
   deleted: (empty_robot)
   added: (block_to_deliver)
   goals met: 0 of 1
17. (reaching_assembly_room r2 r1)
   deleted: (at r2)
   added: (at r1)
   goals met: 0 of 1
18. (ask_assembly_block r1)
   deleted: (block_to_deliver)
   added: (empty_robot)
   changed: (no_blocks) from 3 to 4
   goals met: 0 of 1
19. (check_finished r1)
   added: (finished)
   goals met: 1 of 1
